<a href="https://colab.research.google.com/github/AndreMarques2002/AREngineering/blob/main/SQLite_Python.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **SQLite e Pthon**

In [ ]:
import sqlite3 as sql

In [ ]:
conexao = sql.connect('Database')

cursor = conexao.cursor()

**CREATE TABLE**

In [ ]:
cursor.execute(
    'CREATE TABLE Tabela1 (Data text, Nome text, Idade real)'
)

conexao.commit()

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

**INSERT INTO**

In [ ]:
cursor.execute('INSERT INTO Tabela1 VALUES ("01/01/2000", "João", "24")')

In [ ]:
import random

In [ ]:
for Loop in range(10):
  numero = random.randint(10, 20)
  cursor.execute(f'INSERT INTO Tabela1 VALUES ("01/01/2000", "João", {numero})')

**SELECT**

In [ ]:
query1 = cursor.execute('SELECT Nome, Idade FROM Tabela1').fetchall()

for line in query1:
  print(line)

('João', 24.0)
('João', 20.0)
('João', 17.0)
('João', 10.0)
('João', 16.0)
('João', 17.0)
('João', 13.0)
('João', 10.0)
('João', 13.0)
('João', 16.0)
('João', 11.0)

**WHERE**

In [ ]:
query2 = cursor.execute('SELECT * FROM Tabela1 WHERE Nome <> "João"').fetchall()

for line in query2:
  print(line)

In [ ]:
query3 = cursor.execute('SELECT * FROM Tabela1 WHERE Idade BETWEEN 10 AND 15').fetchall()

for line in query3:
  print(line)

('01/01/2000', 'João', 10.0)
('01/01/2000', 'João', 13.0)
('01/01/2000', 'João', 10.0)
('01/01/2000', 'João', 13.0)
('01/01/2000', 'João', 11.0)

In [ ]:
query4 = cursor.execute('SELECT * FROM Tabela1 WHERE Nome LIKE "%o"').fetchall()

for line in query4:
  print(line)

('01/01/2000', 'João', 24.0)
('01/01/2000', 'João', 20.0)
('01/01/2000', 'João', 17.0)
('01/01/2000', 'João', 10.0)
('01/01/2000', 'João', 16.0)
('01/01/2000', 'João', 17.0)
('01/01/2000', 'João', 13.0)
('01/01/2000', 'João', 10.0)
('01/01/2000', 'João', 13.0)
('01/01/2000', 'João', 16.0)
('01/01/2000', 'João', 11.0)

In [ ]:
query5 = cursor.execute('SELECT * FROM Tabela1 WHERE Idade IN(20, 10 , 16)').fetchall()

for line in query5:
  print(line)

('01/01/2000', 'João', 20.0)
('01/01/2000', 'João', 10.0)
('01/01/2000', 'João', 16.0)
('01/01/2000', 'João', 10.0)
('01/01/2000', 'João', 16.0)

In [ ]:
query6 = cursor.execute('SELECT * FROM Tabela1 WHERE NOT Idade = "10" AND NOT Idade = "11"').fetchall()

for line in query6:
  print(line)

('01/01/2000', 'João', 24.0)
('01/01/2000', 'João', 20.0)
('01/01/2000', 'João', 17.0)
('01/01/2000', 'João', 16.0)
('01/01/2000', 'João', 17.0)
('01/01/2000', 'João', 13.0)
('01/01/2000', 'João', 13.0)
('01/01/2000', 'João', 16.0)

In [ ]:
query7 = cursor.execute('SELECT * FROM Tabela1 ORDER BY Idade DESC').fetchall()

for line in query7:
  print(line)

('01/01/2000', 'João', 24.0)
('01/01/2000', 'João', 20.0)
('01/01/2000', 'João', 17.0)
('01/01/2000', 'João', 17.0)
('01/01/2000', 'João', 16.0)
('01/01/2000', 'João', 16.0)
('01/01/2000', 'João', 13.0)
('01/01/2000', 'João', 13.0)
('01/01/2000', 'João', 11.0)
('01/01/2000', 'João', 10.0)
('01/01/2000', 'João', 10.0)

**UPDATE**

In [ ]:
cursor.execute('INSERT INTO Tabela1 VALUES ("-", null, 30 ) ')

cursor.execute('INSERT INTO Tabela1 VALUES ("-", "José", 30 ) ')

In [ ]:
query8 = cursor.execute('SELECT * FROM Tabela1').fetchall()

for line in query8:
  print(line)

('01/01/2000', 'João', 24.0)
('01/01/2000', 'João', 20.0)
('01/01/2000', 'João', 17.0)
('01/01/2000', 'João', 10.0)
('01/01/2000', 'João', 16.0)
('01/01/2000', 'João', 17.0)
('01/01/2000', 'João', 13.0)
('01/01/2000', 'João', 10.0)
('01/01/2000', 'João', 13.0)
('01/01/2000', 'João', 16.0)
('01/01/2000', 'João', 11.0)
('-', None, 30.0)
('-', None, 30.0)
('-', 'José', 30.0)

In [ ]:
query9 = cursor.execute('UPDATE Tabela1 SET Idade = 30 WHERE Nome IS NULL').fetchall()

query10 = cursor.execute('SELECT * FROM Tabela1').fetchall()

for line in query10:
  print(line)

('01/01/2000', 'João', 24.0)
('01/01/2000', 'João', 20.0)
('01/01/2000', 'João', 17.0)
('01/01/2000', 'João', 10.0)
('01/01/2000', 'João', 16.0)
('01/01/2000', 'João', 17.0)
('01/01/2000', 'João', 13.0)
('01/01/2000', 'João', 10.0)
('01/01/2000', 'João', 13.0)
('01/01/2000', 'João', 16.0)
('01/01/2000', 'João', 11.0)
('-', None, 30.0)
('-', None, 30.0)
('-', 'José', 30.0)

In [ ]:
query11 = cursor.execute('UPDATE Tabela1 SET Nome = "Pedro" WHERE Idade = 30').fetchall()

query12 = cursor.execute('SELECT * FROM Tabela1').fetchall()

for line in query12:
  print(line)

('01/01/2000', 'João', 24.0)
('01/01/2000', 'João', 20.0)
('01/01/2000', 'João', 17.0)
('01/01/2000', 'João', 10.0)
('01/01/2000', 'João', 16.0)
('01/01/2000', 'João', 17.0)
('01/01/2000', 'João', 13.0)
('01/01/2000', 'João', 10.0)
('01/01/2000', 'João', 13.0)
('01/01/2000', 'João', 16.0)
('01/01/2000', 'João', 11.0)
('-', 'Pedro', 30.0)
('-', 'Pedro', 30.0)
('-', 'Pedro', 30.0)

**DELETE**

In [ ]:
query13 = cursor.execute('DELETE FROM Tabela1 WHERE Nome = "João" AND Idade = 10').fetchall()

query14 = cursor.execute('SELECT * FROM Tabela1').fetchall()

for line in query14:
  print(line)

('01/01/2000', 'João', 24.0)
('01/01/2000', 'João', 20.0)
('01/01/2000', 'João', 17.0)
('01/01/2000', 'João', 16.0)
('01/01/2000', 'João', 17.0)
('01/01/2000', 'João', 13.0)
('01/01/2000', 'João', 13.0)
('01/01/2000', 'João', 16.0)
('01/01/2000', 'João', 11.0)
('-', 'Pedro', 30.0)
('-', 'Pedro', 30.0)
('-', 'Pedro', 30.0)

**SELECT TOP**

In [ ]:
query15 = cursor.execute('SELECT * FROM Tabela1 LIMIT 3').fetchall()

for line in query15:
  print(line)

('01/01/2000', 'João', 24.0)
('01/01/2000', 'João', 20.0)
('01/01/2000', 'João', 17.0)

**COUNT, AVG**

In [ ]:
query16 = cursor.execute('SELECT AVG(Idade) FROM Tabela1 WHERE Nome <> "Pedro"').fetchall()

print(query16)

[(16.333333333333332,)]

**INNER JOIN**

In [ ]:
query17 = cursor.execute('''
  CREATE TABLE Vendas (Id real, Valor real)

''').fetchall()
conexao.commit()

In [ ]:
query18 = cursor.execute('''
  CREATE TABLE Caddastro_Vendedor (Id real, Nome text)

''').fetchall()
conexao.commit()

In [ ]:
cursor.execute('INSERT INTO Vendas VALUES (01, 500) ')
cursor.execute('INSERT INTO Vendas VALUES (02, 800) ')
cursor.execute('INSERT INTO Vendas VALUES (01, 100) ')
cursor.execute('INSERT INTO Vendas VALUES (01, 800) ')
cursor.execute('INSERT INTO Vendas VALUES (01, 700) ')
cursor.execute('INSERT INTO Vendas VALUES (02, 200) ')

In [ ]:
cursor.execute('INSERT INTO Caddastro_Vendedor VALUES (01, "Pedro") ')
cursor.execute('INSERT INTO Caddastro_Vendedor VALUES (02, "Matheus") ')

In [ ]:
query19 = cursor.execute('SELECT * FROM Vendas').fetchall()

for line in query19:
  print(line)

(1.0, 500.0)
(2.0, 800.0)
(1.0, 100.0)
(1.0, 800.0)
(1.0, 700.0)
(2.0, 200.0)

In [ ]:
query20 = cursor.execute('''
  SELECT * FROM Vendas
  INNER JOIN Caddastro_Vendedor
  ON Vendas.Id = Caddastro_Vendedor.Id
''').fetchall()

for line in query20:
  print(line)

(1.0, 500.0, 1.0, 'Pedro')
(2.0, 800.0, 2.0, 'Matheus')
(1.0, 100.0, 1.0, 'Pedro')
(1.0, 800.0, 1.0, 'Pedro')
(1.0, 700.0, 1.0, 'Pedro')
(2.0, 200.0, 2.0, 'Matheus')

**UNION**

In [ ]:
query21 = cursor.execute('''
  CREATE TABLE Tabela_2 (Id real, Nome text)
''').fetchall()
conexao.commit()

query22 = cursor.execute('''
  CREATE TABLE Tabela_3 (Id real, Nome text)
''').fetchall()
conexao.commit()

In [ ]:
cursor.execute('INSERT INTO Tabela_2 VALUES ("001", "Maria")')
cursor.execute('INSERT INTO Tabela_2 VALUES ("004", "Ana")')

cursor.execute('INSERT INTO Tabela_3 VALUES ("005", "Bruno")')
cursor.execute('INSERT INTO Tabela_3 VALUES ("002", "Paulo")')

In [ ]:
query23 = cursor.execute('''
  SELECT * FROM Tabela_2
  UNION ALL
  SELECT * FROM Tabela_3
  ORDER BY Id ASC
''').fetchall()

for line in query23:
  print(line)

(1.0, 'Maria')
(2.0, 'Paulo')
(4.0, 'Ana')
(5.0, 'Bruno')

**GROUP BY**

In [ ]:
query24 = cursor.execute('''
  SELECT SUM(Idade) FROM Tabela1
  GROUP BY Nome
''').fetchall()

for line in query24:
  print(line)

(147.0,)
(90.0,)